import math
R = float (input("Введите радиус круга в см: "))
def okr(R):
    a=2*3.14*R 
    b=2*3/14*R/100
    return a,b
a,b=okr(R)
print('Длина окружности:', a, 'см2')
print('Длина окружности:', b, 'м2')

def vso(R):
    c=3.14*R*R
    c1=3.14*R*R/10000
    return c,c1
c,c1=vso(R) 
print ("Площадь круга: ", c, "см2")
print ("Площадь круга: ", c1, "м2")

def ps(R):
    w=R*math.sqrt(2)
    w1=R*math.sqrt(2)/100
    q=R*math.sqrt(3)
    q1=R*math.sqrt(3)/100
    return w,w1,q,q1
w,w1,q,q1=ps(R)
print ("Сторона, вписанного в окружность квадрата: ", w, "см")
print ("Сторона, вписанного в окружность квадрата: ", w1, "м")
print ("Сторона, вписанного в окружность равностороннего треугольника: ", q, "см" )
print ("Сторона, вписанного в окружность равностороннего треугольника: ", q1, "м" )

def kn(R):
    t=2*R
    t1= 2*R/100
    o=2*R*math.sqrt(3)
    o1=2*R*math.sqrt(3)
    f=2*R*math.sin(3.14/8)
    f1=2*R*math.sin(3.14/8)/100
    return t,t1,o,o1,f,f1
t,t1,o,o1,f,f1=kn(R)
print ("Сторона, описанного вокруг окружности квадрата: ", t, "см")
print ("Сторона, описанного вокруг окружности квадрата: ", t1, "м")
print ("Сторона, описанного вокруг окружности равностороннего треугольника: ",o, "см")
print ("Сторона, описанного вокруг окружности равностороннего треугольника: ", o1, "м")
# Синус 22.5° будем считать синусом 3.14/8 радиан
print ("Сторона, описанного около окружности правильного восьмиугольника: ", f, "см")
print ("Сторона, описанного около окружности правильного восьмиугольника: ", f1, "м")



import math
R = float (input("Введите радиус круга в см: "))

def okr(R):
    a=2*3.14*R 
    b=2*3/14*R/100
    return a

def krug(R):
    c=3.14*R*R
    c1=3.14*R*R/10000
    return c

def main():
    a=okr(R)
    c=krug(R)

if __name__=='__main__':
    main()
    
print('Длина окружности:', a, 'см2')
print ("Площадь круга: ", c, "см2")




T = float (input("Введите значение температуры в градусах Цельсия: "))

def tem(T):
    t=T*1.8+32
    return t
t=tem(T)

print("Температура в градусах по Фаренгейту: ", t, "°F")




